/*
 Navicat Premium Data Transfer

 Source Server         : MySQL57
 Source Server Type    : MySQL
 Source Server Version : 50737
 Source Host           : localhost:3306
 Source Schema         : student

 Target Server Type    : MySQL
 Target Server Version : 50737
 File Encoding         : 65001

 Date: 20/05/2024 09:56:56
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for comments
-- ----------------------------
DROP TABLE IF EXISTS `comments`;
CREATE TABLE `comments`  (
  `category` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '花卉种类',
  `user` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '评论用户',
  `time` timestamp NULL DEFAULT NULL COMMENT '评论时间',
  `content` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '评论内容'
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of comments
-- ----------------------------
INSERT INTO `comments` VALUES ('蒲公英', '用户2', '2024-04-21 15:56:05', '蒲公英评论1');
INSERT INTO `comments` VALUES ('玫瑰花', 'admin3', '2024-04-22 15:56:08', '玫瑰花评论1');
INSERT INTO `comments` VALUES ('向日葵', '用户1', '2024-04-23 15:56:13', '向日葵评论1');
INSERT INTO `comments` VALUES ('郁金香', '用户2', '2024-04-24 15:56:16', '郁金香评论1');
INSERT INTO `comments` VALUES ('蒲公英', '用户1', '2024-04-26 15:56:23', '蒲公英评论2');
INSERT INTO `comments` VALUES ('玫瑰花', '用户2', '2024-04-27 15:56:25', '玫瑰花评论2');
INSERT INTO `comments` VALUES ('向日葵', 'admin3', '2024-04-28 09:56:30', '向日葵评论2');
INSERT INTO `comments` VALUES ('郁金香', '用户1', '2024-04-28 15:56:37', '郁金香评论2');
INSERT INTO `comments` VALUES ('小雏菊', '用户1', '2024-04-29 14:45:04', '小雏菊需要充足的阳光，最好是每天至少6小时以上的阳光照射。放在窗边或者阳台上都是不错的选择。');
INSERT INTO `comments` VALUES ('小雏菊', '用户2', '2024-04-29 14:57:20', '为了促进花朵生长，每隔两周左右可以施一次液态肥料，但不要过量，以免伤害到植株。');
INSERT INTO `comments` VALUES ('小雏菊', 'admin3', '2024-04-29 15:12:34', '冬季是小雏菊休眠期，需要减少浇水频率，保持干燥，但不要让土壤完全干透，以免根部受损。');
INSERT INTO `comments` VALUES ('小雏菊', '用户1', '2024-04-29 15:15:24', '在夏季高温天气，小雏菊容易枯萎，需要注意及时增加水分，也可以考虑将其移至稍微阴凉的地方避免过度曝晒。');
INSERT INTO `comments` VALUES ('小雏菊', '用户2', '2024-04-30 15:33:50', '记得定期给小雏菊适量的水，但要避免积水，可以在盆底铺上排水的小石子或砂子，保持通风透气。');

-- ----------------------------
-- Table structure for flower
-- ----------------------------
DROP TABLE IF EXISTS `flower`;
CREATE TABLE `flower`  (
  `name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '名称',
  `Morphological` varchar(1023) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '形态特征',
  `Habits` varchar(1023) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '生长习性',
  `illumination` varchar(1023) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '光照',
  `temperature` varchar(1023) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '温度',
  `watering` varchar(1023) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '水分',
  `fertilize` varchar(1023) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '施肥'
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of flower
-- ----------------------------
INSERT INTO `flower` VALUES ('小雏菊', '雏菊多年生或一年生葶状草本，高10厘米左右。叶基生，草质，匙形，顶端圆钝，基部渐狭成柄，上半部边缘有疏钝齿或波状齿。头状花序单生，直径2.5-3.5厘米，花葶被毛；总苞半球形或宽钟形；总苞片近2层，稍不等长，长椭圆形，顶端钝，外面被柔毛。舌状花一层，雌性，舌片白色带粉红色，开展，全缘或有2-3齿，中央有多数两性花，都结果实，筒状，檐部长，有4-5裂片。', '雏菊性喜冷凉气候， 忌炎热。喜光， 又耐半阴，对栽培地土壤要求不严格。种子发芽适温22-28℃，生育适温20-25℃。西南地区适宜种植中、小花单瓣或半重瓣品种。中、大花重瓣品种长势弱， 结籽差。', '小雏菊喜阳光，需要充足的光照才能正常生长。将其放置在向阳的窗台或阳台，接受阳光照射。夏季阳光强烈时，适当遮荫以防叶片晒伤。', '\r\n\r\n小雏菊适宜的生长温度为15-25℃，在寒冷地区冬季需移入室内保温。夏季高温时，需要注意通风降温。', '小雏菊喜欢湿润的环境，但忌积水。在生长期间，保持土壤湿润即可。夏季炎热时，需增加浇水次数，保持盆土湿润。冬季则要减少浇水，保持土壤略干。', '\r\n在生长期间，每月施一次腐熟的稀薄液肥，以满足小雏菊的生长需求。开花前可施一次磷钾肥，促进开花。注意施肥要适量，避免浓肥烧根。');
INSERT INTO `flower` VALUES ('蒲公英', '蒲公英原植物多年生草本。根圆柱状，黑褐色，粗壮。叶倒卵状披针形、倒披针形或长圆状披针形，长4-20厘米，蒲公英宽1-5厘米，先端钝或急尖，边缘有时具波状齿或羽状深裂，有时倒向羽状深裂或大头羽状深裂，顶端裂片较大，三角形或三角状戟形，全缘或具齿，每侧裂片3-5片，裂片三角形或三角状披针形，通常具齿，平展或倒向，裂片间常夹生小齿，基部渐狭成叶柄，叶柄及主脉常带红紫色，疏被蛛丝状白色柔毛或几无毛。\r\n蒲公英花葶1至数个，与叶等长或稍长，高10-25厘米，含白色乳汁，上部紫红色，密被蛛丝状白色长柔毛；头状花序直径约30-40毫米；总苞钟状，长12-14毫米，淡绿色；总苞片2-3层，外层总苞片卵状披针形或披针形，长8-10毫米，宽1-2毫米，边缘宽膜质，基部淡绿色，上部紫红色，先端增厚或具小到中等的角状突起；内层总苞片线状披针形，长10-16毫米，宽2-3毫米，先端紫红色，具小角状突起；舌状花黄色，舌片长约8毫米，宽约1.5毫米，边缘花舌片背面具紫红色条纹，花药和柱头暗绿色。\r\n蒲公英瘦果倒卵状披针形，暗褐色，长约4-5毫米，宽约1-1.5毫米，上部具小刺，下部具成行排列的小瘤，顶端逐渐收缩为长约1毫米的圆锥至圆柱形喙基，喙长6-10毫米，纤细；冠毛白色，长约6毫米。\r\n蒲公英属菊科多年生草本植物。头状花序，种子上有白色冠毛结成的绒球，花开后随风飘到新的地方孕育新生命。干燥的根，略呈圆锥状，弯曲，长4～10厘米，表面棕褐色，皱缩，根头部有棕色或黄白色的毛茸，或已脱落。叶皱缩成团，或成卷曲的条片。外表绿褐色或暗灰绿色，叶背主脉明显。有时有不完整的头状花序。气微，味微苦。以叶多、色灰绿、根完整、无杂质者为佳。\r\n蒲公英花期4-9月，果期5-10月。', '蒲公英虽然对土壤条件要求不严格，但是它还是喜欢肥沃、湿润、疏松、有机质含量高的土壤。\r\n蒲公英抗病抗虫能力很强，一般不需进行病虫害防治，广泛生于中、低海拔地区的山坡草地、路边、田野、河滩。', '蒲公英适宜生长在充足的阳光下，但也能够在半阴或阴暗环境下存活。', ' 在温度方面，蒲公英在较为温暖的气候下生长最好，适宜的温度范围为15-25摄氏度。', '在养护时，需保持土壤湿润但不过湿，避免过度浇水。每次浇水应保持土壤表面稍干后再次浇水。', '蒲公英属于对土壤中养分要求不高的植物，一般无需特别施肥。可以在春季施一些有机肥或全面肥料，但不要过度施肥，以免造成植株过于茂盛。');
INSERT INTO `flower` VALUES ('玫瑰花', '玫瑰为直立灌木，高可达2米；茎粗壮，丛生；小枝密被绒毛，并有针刺和腺毛，有直立或弯曲、淡黄色的皮刺，皮刺外被绒毛。小叶5-9，连叶柄长5-13厘米；小叶片椭圆形或椭圆状倒卵形，长1.5-4.5厘米，宽1-2.5厘米，先端急尖或圆钝，基部圆形或宽楔形，边缘有尖锐锯齿，上面粉红色，无毛，叶脉下陷，有褶皱，下面灰绿色，中脉突起，网脉明显，密被绒毛和腺毛，有时腺毛不明显；叶柄和叶轴密被绒毛和腺毛；托叶大部贴生于叶柄，离生部分卵形，边缘有带腺锯齿，下面被绒毛。\r\n\r\n玫瑰花单生于叶腋，或数朵簇生，苞片卵形，边缘有腺毛，外被绒毛；花梗长5 -22 5毫米，密被绒毛和腺毛；花直径4-5.5厘米；萼片卵状披针形，先端尾状渐尖，常有羽状裂片而扩展成叶状，上面有稀疏柔毛，下面密被柔毛和腺毛；花瓣倒卵形，重瓣至半重瓣，芳香，紫红色至白色；花柱离生，被毛，稍伸出萼筒口外，比雄蕊短很多。果扁球形，直径2-2.5厘米，砖红色，肉质，平滑，萼片宿存。\r\n\r\n玫瑰茎粗壮，丛生；小枝密被绒毛，并有针刺和腺毛，有小叶5-9，小叶片椭圆形或椭圆状倒卵形，边缘有尖锐锯齿，上面深绿色，无毛，叶脉下陷，有褶皱，下面灰绿色，叶柄和叶轴密被绒毛和腺毛；托叶大部贴生于叶柄，花单生于叶腋，或数朵簇生，花瓣倒卵形，重瓣至半重瓣，芳香，紫红色至白色；果扁球形。\r\n\r\n玫瑰花期5-6月，果期8-9月。', '玫瑰喜阳光充足，耐寒、耐旱，喜排水良好、疏松肥沃的壤土或轻壤土，在粘壤土中生长不良，开花不佳。宜栽植在通风良好、离墙壁较远的地方，以防日光反射，灼伤花苞，影响开花。\r\n玫瑰是高贵、典雅的化身，但它并不娇贵，对生长条件的要求十分低，且耐贫瘠、抗寒、耐旱。用玫瑰杂交而成的品种，在世界各地气候生长条件不太好的地方多有栽种。', '阳光充足可促使生长良好。无论地栽、盆栽均应放阳光充足的地方，每天要接受4小时以上的直射阳光。不能在室内光线不足的地方长期摆放，冬季入室，放向阳处。', '玫瑰喜欢温暖、光照充足的生长环境，不耐高温，温度太高较不适合玫瑰的生长，适宜生长温度为12℃～28℃，但可耐-20℃的低温。', '玫瑰耐旱，一般地栽的平时不浇水，炎夏或春旱时20～30天浇1次。盆栽的2天浇1次，炎夏或春旱时1天浇1次。喷施新高脂膜保肥保墒。', '栽植前在树穴内施入适量有机肥，栽后浇透水。地栽玫瑰对水肥要求不严，一般有3次肥即可。一是花前肥，于春芽荫发前进行沟施，以腐熟的厩肥加腐叶土为好。二是花后肥，花谢后施腐熟的饼肥渣，以补充开花消耗的养分。三是入冬肥，落叶后施人厩肥，以确保玫瑰安全越冬。盆栽玫瑰在牛长期可施稀薄肥水，收10～15天施1次。');
INSERT INTO `flower` VALUES ('向日葵', '向日葵为1年生草本，高1.0～3.5米，杂交品种有半米高植株。茎直立，粗壮，圆形多棱角，为白色粗硬毛。叶通常互生，心状 卵形或卵圆形，先端锐突或渐尖，有基出3脉，边缘具粗锯齿，两面粗糙，被毛，有长柄。\r\n头状花序，极大，直径10~30厘米，单生于茎顶或枝端，常下倾。总苞片多层，叶质，覆瓦状排列，被长硬毛，夏季开花，花序边缘生黄色的舌状花，不结实。花序中部为两性的管状花，棕色或紫色，结实。\r\n瘦果，倒卵形或卵状长圆形，稍扁压，果皮木质化，灰色或黑色，俗称葵花籽。\r\n最常见的向日葵高度为2.5～3.5米。根据1567年的科学文献报告，历来被认为单头向日葵植物是种植在帕多瓦，植株高度最高可达12米。同样的种子，种植在其他时间和地点（如马德里），植株高度可达近8米。更近的纪录（约二十年前）则有8米以上的植株，在荷兰和加拿大安大略省取得。', '向日葵的种植四季皆可，重要以夏、冬两季为主。花期可达两周以上。品种可分为“普通观赏用”品种或“食用”种类，个别观赏用品种特点为植株较矮小，通常不超过半公尺。观赏向日葵因而适合栽种于盆栽中;食用品种则植株较为高大，种于正常露天苗圃泥土中，可长至2公尺以上。向日葵成长相称敏捷，花期相称久长可达两周以上，向日葵的生长与温度、水分、光照、土壤等因素关系密切。', '向日葵为短日照作物。但它对日照的反应并不十分敏感。比如在天津市的日照条件下，无需特殊处理，都能正常开花成熟。向日葵喜欢充足的阳光，其幼苗、叶片和花盘都有很强的向光性。日照充足，幼苗健壮能防止徒长；生育中期日照充足，能促进茎叶生长旺盛，正常开花授粉，提高结实率；生育后期日照充足，子粒充实饱满。', '向日葵原产热带，但对温度的适应性较强，是喜温又耐寒的作物。其种子耐低温能力很强，当地温稳定，在2℃以上，种子就开始萌动；4～5℃时，种子能发芽生根；地温达8～10℃时，就能满足种子发芽出苗的需要。发芽的最适温度为31～37℃，最高温度为38～44℃。向日葵在整个生育过程中，只要温度不低于10℃，就能正常生长。在适宜温度范围内，温度越高，发育越快。', '向日葵植株高大，叶多而密，是耗水较多的作物。它的吸水量是玉米的1.74倍。但因其生长发育多与当地雨热同步，水分供求矛盾不突出。向日葵不同生育阶段对水分的要求差异很大。从播种到现蕾，比较抗旱，需水不多，仅为总需水量1.9%。而适当干旱有利于根系生长，增强抗旱性。现蕾到开花，是需水高峰，需水量约占总需水量的43%。此期缺水，对产量影响很大。此阶段恰逢雨量较多，基本上能满足向日葵生长发育对水分的需要。如过于干旱，需灌水补充。开花到成熟需水量也较多，约占总水量38%。如果水分不足，不仅影响产量，而且还降低油脂含量。', '在生长期的向日葵，一般20天左右施肥一次，如果是开花前还应该追加2-3次稀薄的磷钾肥，具体施肥的时间依据向日葵的种植时间来定，施肥之后需要注意保持土壤的湿润状态。');
INSERT INTO `flower` VALUES ('郁金香', '郁金香为多年生草本，鳞茎扁圆锥形，具棕褐色皮股，鳞茎卵形，直径约2cm，外层皮纸质，内面顶端和基部有少数伏毛。\r\n郁金香茎叶光滑具白粉。叶3～5枚，椭圆状技针形或卵状技针形，长10～21厘米，宽1～6厘米；基生者2～3枚，较宽大，茎生者1～2枚。\r\n郁金香花单生茎顶。大形直立，林状，洋红色，基部常黑紫色。花葶长35～55厘米；花单生，直立，长5～7.5厘米；花瓣6片，倒卵形，鲜黄色或紫红色，具黄色条纹和斑点：雄蕊6，离生，花药长0.7～1.3厘米，基部着生，花丝基部宽阔；雌蕊长1.7～2.5厘米，花柱3裂至基部，反卷。花型有杯型、碗型、卵型、球型、钟型、漏斗型、百合花型等，有单瓣也有重瓣。花色有白、粉红、洋红、紫、褐、黄、橙等，深浅不一，单色或复色。\r\n郁金香花型有杯型、碗型、卵型、球型、钟型、漏斗型、百合花型等，有单瓣也有重瓣。花色有白、粉红、洋红、紫、褐、黄、橙等，深浅不一，单色或复色。\r\n郁金香花期一般为3～5月，有早、中、晚之别。蒴果3室，室背开裂，种子多数，蒴果他背开裂，种子扁平。', '郁金香原产伊朗和土耳其高山地带。由于地中海的气候，形成郁金香适应冬季湿冷和夏季干热的特点，具有夏季休眠、秋冬生根并萌发新芽但不出土，需经冬季低温后第二年2月上旬左右（温度在5℃以上）开始伸展生长形成茎叶，3～4月开花的特性。\r\n郁金香生长开花适温为15～20℃。花芽分化是在茎叶变黄时将鳞茎从盆内掘起放阴冷的室外内度夏的贮藏期间进行的。分化适温为20～25℃，最高不得超过28℃。\r\n郁金香属长日照花卉，性喜阳光充足，冬季温暖湿润，夏季凉爽干燥的气候。耐寒性很强，在严寒地区如有厚雪覆盖，鳞茎就可在露地越冬，但怕酷暑，如果夏天来的早，盛夏又很炎热，则鳞茎休眠后难于度夏。\r\n郁金香要求疏松肥沃、排水良好的微酸性沙质壤土，忌碱土和连作。', '充足的光照对郁金香的生长是必需的，光照不足，将造成植株生长不良，引起落芽，植株变弱，叶色变浅及花期缩短。但郁金香上盆后半个多月时间内，应适当遮光，以利于种球发新根。另外，发芽时，花芽的伸长受光照的抑制，遮光后，能够促进花芽的伸长，防止前期营养生长过快，徒长。出苗后应增加光照，促进植株拔节，形成花蕾并促进着色。后期花蕾完全着色后，应防止阳光直射，延长开花时间。', '在苗前和苗期，白天使室内温度保持在12～15℃，温度过高应及时通风降温，夜间不低于6℃，促使种球早发根，发壮根，培育壮苗。此时温度过高，会使植株茎秆弱，花质差。经过20多天，植株已长出两片叶时，应及时增温，促使花蕾及时脱离苞叶。白天室内温度保持在18～25℃，夜间应保持在10℃以上。一般再经过20多天时间，花冠开始着色，第一支花在12月下旬至1月上旬开放，至盛花期需10～15天，这时应视需花时间的不同分批放置，温度越高，开花越早。一般花冠完全着色后，应将植株放在10℃的环境待售。', '种植后应浇透水，使土壤和种球能够充分紧密结合而有利于生根，出芽后应适当控水，待叶渐伸长，可在叶面喷水，增加空气湿度，抽花薹期和现蕾期要保证充足的水分供应，以促使花朵充分发育，开花后，适当控水。', '由于基质中富含有机肥，生长期间不再追肥，但是如果氮不足而使叶色变淡或植株生长不够粗壮，则可施易吸收的氮肥如尿素、硝酸铵等，量不可多，否则会造成徒长，甚至影响植株对铁的吸收而造成缺铁症（缺铁时新叶、花蕾全部黄化，但老叶正常），生长期间追施液肥效果显著，一般在现蕾至开花每10天喷浓度为2‰～3‰的磷酸二氢钾液一次，以促花大色艳，花茎结实直立。');

-- ----------------------------
-- Table structure for admin
-- ----------------------------
DROP TABLE IF EXISTS `admin`;
CREATE TABLE `admin`  (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `username` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '账号',
  `password` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '密码',
  `name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '名称',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 9 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '管理员' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of admin
-- ----------------------------
INSERT INTO `admin` VALUES (1, 'admin', 'admin', '用户1');
INSERT INTO `admin` VALUES (2, 'adm2', 'adm2', '用户2');
INSERT INTO `admin` VALUES (7, 'admin3', 'admin3', 'admin3');
INSERT INTO `admin` VALUES (8, '测试用户4', 'admin', '测试用户4');

SET FOREIGN_KEY_CHECKS = 1;
